## 4. –£—Å–ª–æ–≤–∏—è WHERE (AND, OR, BETWEEN)

### ‚öôÔ∏è –£—Å–ª–æ–≤–∏—è WHERE (AND, OR, BETWEEN)

**–ü–æ—Å—Ç–∞–Ω–æ–≤–∫–∞ –ø—Ä–æ–±–ª–µ–º—ã:**  
–ò–Ω–æ–≥–¥–∞ –Ω—É–∂–Ω–æ –ø–æ–ª—É—á–∏—Ç—å –Ω–µ –≤—Å–µ –¥–∞–Ω–Ω—ã–µ, –∞ —Ç–æ–ª—å–∫–æ —Ç–µ, —á—Ç–æ —Å–æ–æ—Ç–≤–µ—Ç—Å—Ç–≤—É—é—Ç –æ–ø—Ä–µ–¥–µ–ª—ë–Ω–Ω—ã–º —É—Å–ª–æ–≤–∏—è–º. –ù–∞–ø—Ä–∏–º–µ—Ä: –∫–Ω–∏–≥–∏ –ø–æ—Å–ª–µ 1950 –≥–æ–¥–∞, –∫–Ω–∏–≥–∏ –æ–ø—Ä–µ–¥–µ–ª—ë–Ω–Ω–æ–≥–æ –∞–≤—Ç–æ—Ä–∞ –∏–ª–∏ –∫–Ω–∏–≥–∏, –≤—ã–ø—É—â–µ–Ω–Ω—ã–µ –º–µ–∂–¥—É 1930 –∏ 1950. –î–ª—è —ç—Ç–æ–≥–æ –∏—Å–ø–æ–ª—å–∑—É–µ—Ç—Å—è –∫–ª—é—á–µ–≤–æ–µ —Å–ª–æ–≤–æ `WHERE` —Å —Ä–∞–∑–ª–∏—á–Ω—ã–º–∏ –ª–æ–≥–∏—á–µ—Å–∫–∏–º–∏ –æ–ø–µ—Ä–∞—Ç–æ—Ä–∞–º–∏.

**–ö—Ä–∞—Ç–∫–∞—è —Ç–µ–æ—Ä–∏—è:**  
`WHERE` ‚Äî —ç—Ç–æ —Ñ–∏–ª—å—Ç—Ä –¥–ª—è —Å—Ç—Ä–æ–∫. –û–Ω —É–∫–∞–∑—ã–≤–∞–µ—Ç—Å—è –ø–æ—Å–ª–µ `SELECT` –∏ –æ–ø—Ä–µ–¥–µ–ª—è–µ—Ç, –∫–∞–∫–∏–µ –∑–∞–ø–∏—Å–∏ –ø–æ–ø–∞–¥—É—Ç –≤ —Ä–µ–∑—É–ª—å—Ç–∞—Ç. –ú–æ–∂–Ω–æ –∫–æ–º–±–∏–Ω–∏—Ä–æ–≤–∞—Ç—å —É—Å–ª–æ–≤–∏—è —Å –ø–æ–º–æ—â—å—é `AND`, `OR`, –∏—Å–ø–æ–ª—å–∑–æ–≤–∞—Ç—å `BETWEEN`, `LIKE`, `IN` –∏ –¥—Ä.

**–ü—Ä–∏–º–µ—Ä—ã —Å–∏–Ω—Ç–∞–∫—Å–∏—Å–∞:**
```sql
SELECT * FROM books WHERE author = 'George Orwell';
SELECT * FROM books WHERE year > 1950 AND author = 'J.R.R. Tolkien';
SELECT * FROM books WHERE year BETWEEN 1930 AND 1950;
```

**–ü—Ä–∏–º–µ—Ä:**

In [ ]:
# –£—Å–ª–æ–≤–∏—è WHERE –≤ SQLite
import sqlite3

conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# –°–æ–∑–¥–∞—ë–º —Ç–∞–±–ª–∏—Ü—É –∏ –¥–∞–Ω–Ω—ã–µ
cursor.execute('''
CREATE TABLE books (
    id INTEGER PRIMARY KEY,
    title TEXT NOT NULL,
    author TEXT,
    year INTEGER
);
''')
books = [
    ("1984", "George Orwell", 1949),
    ("The Hobbit", "J.R.R. Tolkien", 1937),
    ("Brave New World", "Aldous Huxley", 1932),
    ("Animal Farm", "George Orwell", 1945),
    ("The Silmarillion", "J.R.R. Tolkien", 1977)
]
cursor.executemany("INSERT INTO books (title, author, year) VALUES (?, ?, ?)", books)
conn.commit()

# –ö–Ω–∏–≥–∏ –î–∂–æ—Ä–¥–∂–∞ –û—Ä—É—ç–ª–ª–∞
cursor.execute("SELECT title FROM books WHERE author = 'George Orwell'")
print("üìò –ö–Ω–∏–≥–∏ George Orwell:")
for row in cursor.fetchall():
    print(row[0])

# –ö–Ω–∏–≥–∏ –ø–æ—Å–ª–µ 1950 –≥–æ–¥–∞ –ò–õ–ò –∞–≤—Ç–æ—Ä Tolkien
cursor.execute("SELECT title, year FROM books WHERE year > 1950 OR author = 'J.R.R. Tolkien'")
print("\nüìó –ü–æ—Å–ª–µ 1950 –∏–ª–∏ Tolkien:")
for row in cursor.fetchall():
    print(row)

# –ö–Ω–∏–≥–∏ –º–µ–∂–¥—É 1930 –∏ 1950
cursor.execute("SELECT title, year FROM books WHERE year BETWEEN 1930 AND 1950")
print("\nüìï –ö–Ω–∏–≥–∏ –º–µ–∂–¥—É 1930 –∏ 1950:")
for row in cursor.fetchall():
    print(row)